app/controllers/produtos_controller.rb

  def index
    @produtos_por_nome = Produto.all.order(:nome).limit 5
    @produtos_por_preco = Produto.all.order(:preco).limit 2
---
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC LIMIT ?  [["LIMIT", 5]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 2]]

  def create
    @produto = Produto.new produto_params
    if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "agora vai"], ["descricao", "né?"], ["quantidade", 90], ["preco", 90.0], ["created_at", "2018-01-18 16:10:09.776344"], ["updated_at", "2018-01-18 16:10:09.776344"]]

  def update
    if @produto.update produto_params
---
UPDATE "produtos" SET "nome" = ?, "descricao" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Blusinha almofadinha "], ["descricao", "Blusinha pra quem trabalha no banco ou pro Doria"], ["updated_at", "2018-01-23 16:42:44.341627"], ["id", 11]]

  def busca
    nome_a_buscar = "%#{params[:nome]}%"
    @produtos = Produto.where "nome like ?", nome_a_buscar
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%%')

  def set_produto
    id = params[:id]
    @produto = Produto.find(id)
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]